# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitionCreationOptions..::..Description Property
ExternalDefinitionCreationOptions Class See Also
---
The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Description { get; set; }
```

Visual Basic
---
```text
Public Property Description As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace